/*!--------------------------------------------------------
 * Copyright (C) Microsoft Corporation. All rights reserved.
 *--------------------------------------------------------*/
define("vs/base/common/worker/workerServer.nls.ja", {
	"vs/base/common/severity": [
		"エラー",
		"警告",
		"情報",
	],
	"vs/editor/common/config/defaultConfig": [
		"エディターのコンテンツ",
	],
	"vs/editor/common/model/textModelWithTokens": [
		"入力のトークン化中にモードが失敗しました。",
	],
	"vs/editor/common/modes/modesRegistry": [
		"プレーンテキスト",
	],
	"vs/editor/common/services/modeServiceImpl": [
		"言語の宣言を提供します。",
		"言語の ID。",
		"言語の名前のエイリアス。",
		"言語に関連付けられているファイルの拡張子。",
		"言語に関連付けられたファイル名。",
		"言語に関連付けられたファイル名の glob パターン。",
		"言語に関連付けられている MIME の種類。",
		"言語のファイルの最初の行に一致する正規表現。",
		"言語の構成オプションを含むファイルへの相対パス。",
		"`contributes.{0}` に対する空の値",
		"プロパティ `{0}` は必須で、型 `string` でなければなりません",
		"プロパティ `{0}` を省略するか、型 `string[]` にする必要があります",
		"プロパティ `{0}` を省略するか、型 `string[]` にする必要があります",
		"プロパティ `{0}` を省略するか、型 `string` にする必要があります",
		"プロパティ `{0}` を省略するか、型 `string` にする必要があります",
		"プロパティ `{0}` を省略するか、型 `string[]` にする必要があります",
		"プロパティ `{0}` を省略するか、型 `string[]` にする必要があります",
		"正しくない `contributes.{0}`。配列が必要です。",
	],
	"vs/platform/extensions/common/abstractExtensionService": [
		"拡張機能 `{1}` のアクティブ化に失敗しました。理由: 依存関係 `{0}` が不明です。",
		"拡張機能 `{1}` のアクティブ化に失敗しました。理由: 依存関係 `{0}` のアクティブ化に失敗しました。",
		"拡張機能 `{0}` のアクティブ化に失敗しました。理由: 依存関係のレベルが 10 を超えています (依存関係のループの可能性があります)。",
		"拡張機能 `{0}` のアクティブ化に失敗しました: {1}。",
	],
	"vs/platform/extensions/common/extensionsRegistry": [
		"空の拡張機能の説明を入手しました",
		"プロパティ `{0}` は必須で、型 `string` でなければなりません",
		"プロパティ `{0}` は必須で、型 `string` でなければなりません",
		"プロパティ `{0}` は必須で、型 `string` でなければなりません",
		"プロパティ `{0}` は必須で、型 `object` でなければなりません",
		"プロパティ `{0}` は必須で、型 `string` でなければなりません",
		"プロパティ `{0}` は省略するか、型 `string[]` にする必要があります",
		"プロパティ `{0}` は省略するか、型 `string[]` にする必要があります",
		"プロパティ `{0}` と `{1}` は、両方とも指定するか両方とも省略しなければなりません",
		"プロパティ `{0}` は省略するか、型 `string` にする必要があります",
		"拡張機能のフォルダー ({1}) の中に `main` ({0}) が含まれることが予期されます。これにより拡張機能を移植できなくなる可能性があります。",
		"プロパティ `{0}` と `{1}` は、両方とも指定するか両方とも省略しなければなりません",
		"VS Code ギャラリーで使用される拡張機能の表示名。",
		"VS Code ギャラリーで拡張機能の分類に使用されるカテゴリ。",
		"VS Code マーケットプレースで使用されるバナー。",
		"VS Code マーケットプレース ページ ヘッダー上のバナーの色。",
		"バナーで使用されるフォントの配色テーマ。",
		"VS Code 拡張機能の公開元。",
		"VS Code 拡張機能のアクティブ化イベント。",
		"他の拡張機能に対する依存関係。拡張機能の識別子は常に ${publisher}.${name} です。例: vscode.csharp。",
		"パッケージが VS Code 拡張機能として公開される前に実行されるスクリプト。",
		"このパッケージで表される VS Code 拡張機能のすべてのコントリビューション。",
	]
});