{"settingsDocumentHelper":["o nome do arquivo (por exemplo, MyFile. txt)","o caminho do arquivo relativo à pasta de trabalho (por exemplo, myFolder/myFile.txt)","o caminho completo do arquivo (por exemplo, /Users/Development/myProject/myFolder/myFile.txt)","nome da área de trabalho (por exemplo, minhaPasta ou minhaAreadeTrabalho)","caminho do arquivo da área de trabalho (por exemplo, /Usuarios/Desenvolvimento/minhaAreadeTrabalho)","nome do diretório da área de trabalho onde arquivo está localizado (por exemplo, myFolder)","caminho do arquivo no diretório da área de trabalho onde o arquivo está localizado (por exemplo, /Users/Development/myFolder)","por exemplo VS Code","Um indicador de alteração se o editor ativo foi alterado","um separador condicional (' - ') que somente é mostrado quando envolvido por variáveis com valores","Arquivos com Extensão","Mapear todos arquivos que correspondem ao padrão global no seu nome de arquivo à linguagem com o identificador dado","Arquivos com Caminho","Mapear todos os arquivos que correspondem ao caminho absoluto global no seu caminho à linguagem com o identificador dado","Arquivos por Extensão","Combina todos os arquivos de uma extensão de arquivo específica.","Arquivos com Várias Extensões","Combina todos os arquivos com qualquer uma das extensões de arquivo.","Arquivos com Irmãos por Nome","Combina arquivos que têm irmãos com o mesmo nome, mas uma extensão diferente.","Pasta por Nome (Nível Superior)","Combina uma pasta de nível superior com um nome específico.","Pastas com Vários Nomes (Nível Superior)","Combina várias pastas de nível superior.","Pasta por Nome (Qualquer Local)","Combina uma pasta com um nome específico em qualquer local.","Desabilita o padrão.","Habilita o padrão.","Arquivos com Irmãos por Nome","Combina arquivos que têm irmãos com o mesmo nome, mas uma extensão diferente.","Configurações do editor especificas para a linguagem","Sobrescrever as configurações do editor para a linguagem"],"extension":["Exemplo"]}