/*!--------------------------------------------------------
 * Copyright (C) Microsoft Corporation. All rights reserved.
 *--------------------------------------------------------*/
define("vs/workbench/node/extensionHostProcess.nls.ko", {
	"vs/base/common/json": [
		"잘못된 기호",
		"잘못된 숫자 형식",
		"속성 이름 필요",
		"값 필요",
		"콜론이 필요합니다.",
		"쉼표가 필요합니다.",
		"닫는 괄호 필요",
		"닫는 대괄호 필요",
		"파일 끝 필요",
	],
	"vs/base/common/severity": [
		"오류",
		"경고",
		"정보",
	],
	"vs/platform/extensions/common/abstractExtensionService": [
		"확장 `{1}`을(를) 활성화하지 못했습니다. 이유: 알 수 없는 종속성 `{0}`.",
		"확장 `{1}`을(를) 활성화하지 못했습니다. 이유: 종속성 `{0}`이(가) 활성화되지 않았습니다.",
		"확장 `{0}`을(를) 활성화하지 못했습니다. 이유: 종속성 수준이 10개가 넘음(종속성 루프일 가능성이 높음).",
		"확장 `{0}` 활성화 실패: {1}.",
	],
	"vs/platform/extensions/common/extensionsRegistry": [
		"가져온 확장 설명이 비어 있습니다.",
		"속성 `{0}`은(는) 필수이며 `string` 형식이어야 합니다.",
		"속성 `{0}`은(는) 필수이며 `string` 형식이어야 합니다.",
		"속성 `{0}`은(는) 필수이며 `string` 형식이어야 합니다.",
		"속성 `{0}`은(는) 필수이며 `object` 형식이어야 합니다.",
		"속성 `{0}`은(는) 필수이며 `string` 형식이어야 합니다.",
		"속성 `{0}`은(는) 생략할 수 있으며 `string[]` 형식이어야 합니다.",
		"속성 `{0}`은(는) 생략할 수 있으며 `string[]` 형식이어야 합니다.",
		"속성 `{0}` 및 `{1}`은(는) 둘 다 지정하거나 둘 다 생략해야 합니다.",
		"속성 `{0}`은(는) 생략할 수 있으며 `string` 형식이어야 합니다.",
		"확장의 폴더({1}) 내에 포함할 `main`({0})이 필요합니다. 이로 인해 확장이 이식 불가능한 상태가 될 수 있습니다.",
		"속성 `{0}` 및 `{1}`은(는) 둘 다 지정하거나 둘 다 생략해야 합니다.",
		"VS Code 갤러리에 사용되는 확장의 표시 이름입니다.",
		"확장을 분류하기 위해 VS Code 갤러리에서 사용하는 범주입니다.",
		"VS Code 마켓플레이스에 사용되는 배너입니다.",
		"VS Code 마켓플레이스 페이지 머리글의 배너 색상입니다.",
		"배너에 사용되는 글꼴의 색상 테마입니다.",
		"VS Code 확장의 게시자입니다.",
		"VS Code 확장에 대한 활성화 이벤트입니다.",
		"다른 확장에 대한 종속성입니다. 확장 식별자는 항상 ${publisher}.${name}입니다(예: vscode.csharp).",
		"패키지가 VS Code 확장 형태로 게시되기 전에 스크립트가 실행되었습니다.",
		"이 패키지에 표시된 VS Code 확장의 전체 기여입니다.",
	],
	"vs/platform/extensions/node/extensionValidator": [
		"`engines.vscode` 값 {0}을(를) 구문 분석할 수 없습니다. ^0.10.0, ^1.2.3, ^0.11.0, ^0.10.x 등을 사용하세요.",
		"`engines.vscode`({0})에 지정된 버전이 명확하지 않습니다. vscode 버전이 1.0.0 이전이면 최소한 원하는 주 버전과 부 버전을 정의하세요( 예: ^0.10.0, 0.10.x, 0.11.0 등).",
		"`engines.vscode`({0})에 지정된 버전이 명확하지 않습니다. vscode 버전이 1.0.0 이후이면 최소한 원하는 주 버전을 정의하세요(예: ^1.10.0, 1.10.x, 1.x.x, 2.x.x 등).",
		"확장이 Code {0}과(와) 호환되지 않습니다. 확장에 {1}이(가) 필요합니다.",
		"확장 버전이 semver와 호환되지 않습니다.",
	],
	"vs/workbench/api/node/extHostDiagnostics": [
		"{0}개의 추가 오류 및 경고를 표시하지 않습니다.",
	],
	"vs/workbench/node/extensionHostMain": [
		"확장 {0}을(를) {1}(으)로 덮어쓰는 중입니다.",
		"{0}에서 개발 확장 로드 중",
		"확장 {0}을(를) {1}(으)로 덮어쓰는 중입니다.",
		"경로 {0}이(가) 유효한 확장 Test Runner를 가리키지 않습니다.",
	],
	"vs/workbench/node/extensionPoints": [
		"{0}을(를) 구문 분석하지 못함: {1}.",
		"파일 {0}을(를) 읽을 수 없음: {1}.",
		"{0}을(를) 구문 분석하지 못함: {1}.",
		"파일 {0}을(를) 읽을 수 없음: {1}.",
		"키 {0}에 대한 메시지를 찾을 수 없습니다.",
	]
});